blog/2010/02/06/c-+-+-template/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>C++模板 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>C++模板</h1>
  <p>
泛型编程技术支持程序员创建函数和类的蓝图（即模板，template），而不是具体的函数和类。
</p>

<p>
语法如下：
</p>


<pre class="example">
    // 两种方式都可以
template 
template
</pre>


<p>
从程序员的角度看，使用模板是一件很简单的事情，但需要编译器做的事情大大增加了，当编译器遇到一个模板时、（比如：swap()函数）时：
</p>


<pre class="example">
template void swap(T &amp;a, T &amp;b)
{
    T tmp = a;
    a = b;
    b = tmp;
}
</pre>


<p>
它不会立刻生成代码，只会检查语法错误并记住“有个名为swap的函数包含着不确定的类型”这个事实。
当你第一次使用某种具体的数据类型来调用这个函数时：
</p>


<pre class="example">
int i1 = 42;
int i2 = 13;
swap(i1, i2);
</pre>


<p>
编译器将注意到这是一个函数模板，但这个模板还没有一个针对int类型的实现，于是它将swap()函数模板的源代码里的T全部替换成int， 其结果是得到一个如下所示的函数：
</p>


<pre class="example">
void swap(int &amp;a, int &amp;b)
{
    int tmp = a;
    a = b;
    b = tmp;
}
</pre>


<p>
这是一个可以编译的函数。
需要注意几点：
</p>
<ol class="org-ol">
<li>template 中的class并不是指T是一个类
</li>
<li>不要把函数模板分成原型和实现两个部分。如果编译器看不到模板的完整代码，它就无法正确地生成代码。
</li>
<li>为了明确表示swap是一个函数模板，还可以使用swap(i1, i2)语法
</li>
<li>区分什么时候用模板什么时候用重载
</li>
<li>C++并没有限制只能胀一个类型占位符，如果类模板需要一种以上的类型，根据具体情况可多使用几个占位符：
</li>
</ol>


<pre class="example">
template class MyClass
{
    // ...
}
</pre>


<p>
这样，在对类进行实例化时，需要在尖括号里以逗号作为分隔符把不同的占位符分别替换为相应的具体类型：
</p>


<pre class="example">
MyClass myClass;
</pre>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
